In [10]:
import pandas as pd

In [16]:
df = pd.read_csv("data/salaries.csv")
df.head()

TypeError: 'tuple' object is not callable

In [12]:
df['degree_number'] = df['degree'].map({'masters':1,'bachelors':2})
df.head()

,company,job,degree,salary_more_then_100k,degree_number
0,google,sales executive,bachelors,0,2
1,google,sales executive,masters,0,1
2,google,business manager,bachelors,1,2
3,google,business manager,masters,1,1
4,google,computer programmer,bachelors,0,2

In [13]:
df.drop('degree_number',axis='columns',inplace=True)
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [15]:
df_encoded= pd.get_dummies(df,columns=['company', 'job'], drop_first=True)
df_encoded.head()

,degree,salary_more_then_100k,company_facebook,company_google,job_computer programmer,job_sales executive
0,bachelors,0,False,True,False,True
1,masters,0,False,True,False,True
2,bachelors,1,False,True,False,False
3,masters,1,False,True,False,False
4,bachelors,0,False,True,True,False